ServiceDesk/src/Documents/ЗаявкаПользователя/ЗаявкаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаПользователя</name>
  <basedOn>Document.ЗаявкаПользователя</basedOn>
  <registerRecords>AccumulationRegister.ВыполненыеЗаявки</registerRecords>
  <attributes>
    <name>Архитектор1</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Архитектор2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>База1С</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесНаправление</name>
    <type>
      <types>EnumRef.БизнесНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.СтепениВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполненияФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаКратко</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроллер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </attributes>
  <attributes>
    <name>РелизОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаявки</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудоёмкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроекта</name>
    <type>
      <types>CatalogRef.ЭтапыПроекта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <comment>Имя файла</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Хранилище</name>
      <comment>Хранилище</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Наблюдатель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ServiceDesk/src/Catalogs/СостоянияЗаявки/СостоянияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗаявки</name>
  <predefined>
    <items>
      <name>ВОжидании</name>
      <description>В ожидании</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Закрыта</name>
      <description>Закрыта</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаКонтроле</name>
      <description>На контроле</description>
    </items>
    <items>
      <name>НаПроверке</name>
      <description>На проверке</description>
    </items>
    <items>
      <name>НаСогласовании</name>
      <description>На согласовании</description>
    </items>
    <items>
      <name>ОжиданиеОтвета</name>
      <description>Ожидание ответа заказчика</description>
    </items>
    <items>
      <name>ОписаниеПроектногоРешения</name>
      <description>Описание проектного решения</description>
    </items>
    <items>
      <name>Отменена</name>
      <description>Отменена</description>
    </items>
    <items>
      <name>ПереданаКИсполнению</name>
      <description>Передана к исполнению</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения1</name>
      <description>Согласование проектного решения</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения2</name>
      <description>Согласование проектного решения</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяУстанавливаемойДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеПлановыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/Catalogs/ВидыДеятельности/ВидыДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДеятельности</name>
  <predefined>
    <items>
      <name>Консультация</name>
      <description>1 - Консультация</description>
    </items>
    <items>
      <name>ИсправлениеОшибок</name>
      <description>2 - Ошибка разработчика</description>
    </items>
    <items>
      <name>Разработка</name>
      <description>3 - Разработка</description>
    </items>
    <items>
      <name>ОшибкиПользователей</name>
      <description>4 - Ошибка пользователя</description>
    </items>
    <items>
      <name>ОбработкаДанных</name>
      <description>5 - Обработка данных</description>
    </items>
  </predefined>
  <attributes>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПринятияВРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРешенияИнцедента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Постоянная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/Documents/ЗаявкаПользователя/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаПользователя") Тогда
		
		Дата				= ТекущаяДатаСеанса();
		Заказчик			= ДанныеЗаполнения.Заказчик;		
		БизнесНаправление	= ДанныеЗаполнения.БизнесНаправление;
		Тестировщик			= ДанныеЗаполнения.Тестировщик;
		ДатаВыполнения		= ДобавитьМесяц(Дата, 1);
		
		Важность			= ДанныеЗаполнения.Важность;
		ВидДеятельности 	= ДанныеЗаполнения.ВидДеятельности;
		Основание			= ДанныеЗаполнения.Ссылка;
			
		База1С				= ДанныеЗаполнения.База1С;
		Проект				= ДанныеЗаполнения.Проект;
		ЭтапПроекта			= ДанныеЗаполнения.ЭтапПроекта;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ВложенныеФайлы.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ДополнительныеСвойства.Свойство("СостояниеЗаявки") Тогда
		пСостояниеЗаявки = ОбщегоНазначенияСервер.ПолучитьСостояниеЗаявки(Ссылка);
		ДополнительныеСвойства.Вставить("СостояниеЗаявки", пСостояниеЗаявки.СостояниеЗаявки);
		ДополнительныеСвойства.Вставить("СостояниеЗаявкиСтарое", пСостояниеЗаявки.СостояниеЗаявкиСтарое);
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("Модифицированность") Тогда
		ДополнительныеСвойства.Вставить("Модифицированность", Ложь);
	КонецЕсли;
	
	Если ДополнительныеСвойства.СостояниеЗаявки = Справочники.СостоянияЗаявки.ВРаботе Тогда
		ДатаВыполненияФакт	= Дата(1,1,1);
	ИначеЕсли ДополнительныеСвойства.СостояниеЗаявки = Справочники.СостоянияЗаявки.Выполнена ИЛИ ДополнительныеСвойства.СостояниеЗаявки = Справочники.СостоянияЗаявки.НаПроверке Тогда
		ДатаВыполненияФакт	= ?(ДатаВыполненияФакт = Дата(1,1,1), ТекущаяДатаСеанса(), ДатаВыполненияФакт);
	КонецЕсли;
	
	Если Не Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение И Ссылка.Пустая() Тогда
		ДополнительныеСвойства.Вставить("ЗапуститьБП", Истина);
	Иначе
		ДополнительныеСвойства.Вставить("ЗапуститьБП", Ложь);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ДополнительныеСвойства.ЗапуститьБП Тогда 
		ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Ссылка, "Зарегистрирована");		
	КонецЕсли;
		
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение И ДополнительныеСвойства.Модифицированность Тогда 
		РаботаСБизнесПроцессами.ОбработатьСобытияДокумента("ПроведениеДокументаЗаявка", Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Ссылка.Пустая() Тогда 
		СостояниеЗаявки			= Справочники.СостоянияЗаявки.ПустаяСсылка();
		СостояниеЗаявкиСтарое   = Справочники.СостоянияЗаявки.ПустаяСсылка();
	ИначеЕсли ПометкаУдаления Тогда	
		СостояниеЗаявки			= Справочники.СостоянияЗаявки.Закрыта;
		СостояниеЗаявкиСтарое   = Справочники.СостоянияЗаявки.ПустаяСсылка();
	Иначе		
		пСостояниеЗаявки		= ОбщегоНазначенияСервер.ПолучитьСостояниеЗаявки(Ссылка);
		СостояниеЗаявки			= пСостояниеЗаявки.СостояниеЗаявки;
		СостояниеЗаявкиСтарое   = пСостояниеЗаявки.СостояниеЗаявкиСтарое;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("СостояниеЗаявки", СостояниеЗаявки);
	ДополнительныеСвойства.Вставить("СостояниеЗаявкиСтарое", СостояниеЗаявкиСтарое);
	
	Если СостояниеЗаявки.ПроверятьЗаполнениеПлановыхПоказателей Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаВыполнения");		
	КонецЕсли;
	
	Если СостояниеЗаявки = Справочники.СостоянияЗаявки.ПереданаКИсполнению Тогда
		ПроверяемыеРеквизиты.Добавить("База1С");
		ПроверяемыеРеквизиты.Добавить("ДатаВыполнения");
		ПроверяемыеРеквизиты.Добавить("БизнесНаправление");
		ПроверяемыеРеквизиты.Добавить("Исполнитель");
		ПроверяемыеРеквизиты.Добавить("Заказчик");
	КонецЕсли;
	
	Если ВидДеятельности = Справочники.ВидыДеятельности.Разработка Или ВидДеятельности = Справочники.ВидыДеятельности.ИсправлениеОшибок Тогда
		
		//Если Истина
		//	И СостояниеЗаявки <> Справочники.СостоянияЗаявки.ПустаяСсылка()
		//	И СостояниеЗаявки <> Справочники.СостоянияЗаявки.Зарегистрирована
		//	//И СостояниеЗаявки <> Справочники.СостоянияЗаявки.НаСогласовании
		//	И СостояниеЗаявки <> Справочники.СостоянияЗаявки.ОписаниеПроектногоРешения
		//	И СостояниеЗаявки <> Справочники.СостоянияЗаявки.СогласованиеПроектногоРешения1
		//	И СостояниеЗаявки <> Справочники.СостоянияЗаявки.СогласованиеПроектногоРешения2
		//	И СостояниеЗаявки <> Справочники.СостоянияЗаявки.Отменена
		//	И СостояниеЗаявки <> Справочники.СостоянияЗаявки.Закрыта
		//Тогда
		//	ПроверяемыеРеквизиты.Добавить("Тестировщик");
		//КонецЕсли;
		
		Если База1С.КонтрольРелизов Тогда
			Если СостояниеЗаявки = Справочники.СостоянияЗаявки.ПереданаКИсполнению Тогда
				ПроверяемыеРеквизиты.Добавить("Релиз");
			КонецЕсли;
		КонецЕсли;
		
		Если СостояниеЗаявки = Справочники.СостоянияЗаявки.ВРаботе Тогда
			ПроверяемыеРеквизиты.Добавить("Трудоёмкость");	
		КонецЕсли;		
				
	КонецЕсли;	
	
КонецПроцедуры
